#include "Stdafx.h"
using namespace std;

/*
Создать бинарный файл с информацией о предложенных к реализации мониторах:
	- название фирмы;
	- размер по диагонали;
	- стоимость. 
Определить среднюю цену мониторов, размером не менее 19 дюймов и распечатать сведения о них
*/

void Base()
{
	cout << "\nBase level\n";

}
